app/Controllers/StudentController.php

SELECT *
FROM `student`
---
    public function fetchAll() {
        $students = $this->studentModel->findAll();

INSERT INTO `student` (`firstname`, `lastname`, `address`, `email`, `gender`, `pincode`, `course`, `image`) VALUES ('rekha', 'kalsariya', 'katargam', 'rekha@gmail.com', 'Female', '234567', 'MCA', '1733460862_f300601ea04f0594148f.png')
---
    public function insert() {

        $validationRules = [
            'firstname' => 'required|min_length[3]|max_length[100]',
            'lastname'  => 'required|min_length[3]|max_length[100]',
            'address'   => 'required|min_length[5]',
            'email'     => 'required|valid_email',
            'gender' => 'required|in_list[Male,Female]',
            'pincode'   => 'required|regex_match[/^[0-9]{6}$/]',
            'course'    => 'required',
            'image'     => 'uploaded[image]|is_image[image]|max_size[image,2048]'
        ];

        if (!$this->validate($validationRules)) {
            return $this->response->setJSON(['status' => 'error', 'errors' => $this->validator->getErrors()]);
        }

        $student = $this->request->getPost();
        $image = $this->request->getFile('image');
        if ($image && $image->isValid() && !$image->hasMoved()) {
            $imageName = $image->getRandomName();
            $image->move(ROOTPATH . 'public/uploads', $imageName);
            $student['image'] = $imageName;
        }

        if ($this->studentModel->insert($student)) {

UPDATE `student` SET `firstname` = 'shital', `lastname` = 'dholikiya', `address` = 'katargam', `email` = 'demo@gmail.com', `gender` = 'Female', `pincode` = '2345678', `course` = 'BCOM', `image` = '1733460673_9494ac9818885597ef1c.png'
WHERE `student`.`id` IN ('58')
---
    public function update($id) {
        $data = $this->request->getPost();
        $image = $this->request->getFile('image');

        if ($image && $image->isValid() && !$image->hasMoved()) {
            $imageName = $image->getRandomName();
            $image->move(ROOTPATH . 'public/uploads', $imageName);
            $data['image'] = $imageName;
        }

        if ($this->studentModel->update($id, $data)) {

SELECT *
FROM `student`
WHERE `student`.`id` = '59'
DELETE FROM `student`
WHERE `id` IN ('59')
---
    public function delete($id) {

        $student = $this->studentModel->find($id);
        if (!$student) {
            return $this->response->setJSON(['status' => 'error', 'message' => 'Student not found.']);
        }


        if ($this->studentModel->delete($id)) {